{"_id":{"$oid":"68a208fbcd62724bd55caf25"},"slug":"advice-vs-advise","title":"advice vs advise","words":["advice","advise"],"meanings":{"advice":"it is a noun that means a suggestion or an idea about what to do","advise":"it is a verb which means to give an opinion or information to someone"},"usage_en":{"advice":"Use it as a noun to talk about the idea being given","advise":"Use it as a verb meaning to give an opinion or suggestion"},"usage_so":{"advice":"Advice waa magac haddaba u adeegso marka talo ama aragtida lafteeda aad ka hadlayso","advise":"Advise waa fal haddaba u adeegso marka talo bixinteeda aad ka hadlayso"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf26"},"slug":"bored-vs-boring","title":"bored vs boring","words":["bored","boring"],"meanings":{"bored":"it is an adjective used to talk about how a person feels when he or she is not enjoying","boring":"it is an adjective used to talk about something or someone that is not interesting"},"usage_en":{"bored":"Use it to talk about how you feel when you are not enjoying or you are not having fun","boring":"Use it to talk about something or a person that is not interesting"},"usage_so":{"bored":"U adeegso sida aad dareemeyso marka wax ama qof aanu ku xiiso gelin","boring":"U adeegso qof ama wax aan xiiso lahayn"},"examples":["I am bored by the boring game."]}
{"_id":{"$oid":"68a208fbcd62724bd55caf27"},"slug":"borrow-vs-lend","title":"borrow vs lend","words":["borrow","lend"],"meanings":{"borrow":"to get or take something for a period of time and  give it  back to the owner later","lend":"to give  something to someone for a period of time expecting you will get it back"},"usage_en":{"borrow":"Use it when you get or recieve something","lend":"Use it when you give something to someone"},"usage_so":{"borrow":"U adeegso marka aad wax soo amaahato","lend":"U adeegso marka aad adigu cid wax amaahiso"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf28"},"slug":"both-vs-either","title":"both vs either","words":["both","either"],"meanings":{"both":"to talk about two people or two things together","either":"to talk about one of two things"},"usage_en":{"both":"We use both when two things are together.  Both is plural.","either":"We use either to show there are two choices.  Either is singular."},"usage_so":{"both":"Macnaha both waa labadaba marka u adeegso labo la is raacinayo","either":"Macnaha either waa midkood haddaba u adeegso marka labo aan kala dooran karno"},"examples":["Both of them are located in Canada.","Both are located in Canada.","We can drink tea.  We can drink orange juice.","We can drink either tea or orange juice.","We can drink either of them.","Either is fine.","I don’t want either of them.  (with negatives, use either)"]}
{"_id":{"$oid":"68a208fbcd62724bd55caf29"},"slug":"neither-vs-nor","title":"neither vs nor","words":["neither","nor"],"meanings":{"neither":"means that both choices are bad. Not one and not the other","nor":"means not and it is often used with neither"},"usage_en":{"neither":"use it in two negative ideas to show that none of them is true","nor":"use to introduce the second half of a negative statement after neither"},"usage_so":{"neither":"Macnaha ereyga neither waa midkoodna ama labaduba ma habboona","nor":"Macnaha ereyga nor waxa uu noqonayaa kanna waa la mid oo waa maya"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf2a"},"slug":"do-vs-make","title":"do vs make","words":["do","make"],"meanings":{"do":"to talk about the action and daily tasks","make":"to talk about the result of the action or when you make something"},"usage_en":{"do":"Use it with action words like work, exercise, homework, business or a favor","make":"Use it for starting or creating something like a plan, a decision, a cake or a phone call"},"usage_so":{"do":"U adeegso fal ama wax la qabanayo sida jimicsi, shaqo-guri, ganacsi laga shaqaynayo","make":"U adeegso marka falkaagu uu wax abuurayo ama samaynayo sida qorshe ama go'aan oo kale"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf2b"},"slug":"hear-vs-listen","title":"hear vs listen","words":["hear","listen"],"meanings":{"hear":"to hear sounds that come to our ears whether you pay attention or not","listen":"to pay attention in order to listen to something like a speech or a song"},"usage_en":{"hear":"Use it for sounds that come to your ears","listen":"Use it when you are listening to something you want to  listen to"},"usage_so":{"hear":"macnaha ereyga hear waa maqal","listen":"macnaha ereyga listen waa dhageysi"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf2c"},"slug":"between-vs-among","title":"between vs among","words":["between","among"],"meanings":{"between":"in the middle of two things or two people that are not seen as a group","among":"in the middle of a group of things or people"},"usage_en":{"between":"Use it when you talk about two things that are separate on each side","among":"Use it for something that is in a group or surrounded by a larger number of things."},"usage_so":{"between":"U adeegso between marka aad ka hadlayso labo midiba gooni u taagan tahay","among":"U adeegso among marka shay ama qof uu ku dhex jiro koox ama waxyaabo badan"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf2d"},"slug":"little-vs-a-little","title":"little vs a little","words":["little","a little"],"meanings":{"little":"not much or almost nothing","a little":"small amount"},"usage_en":{"little":"use it when there is nothing or not much of something.","a little":"use it to show there is a small amount of something"},"usage_so":{"little":"U adeegso marka aanay waxba jirin ama aanay kifaayo ahayn","a little":"U adeegso marka aad cabbirayso wax yar"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf2e"},"slug":"very-vs-too","title":"very vs too","words":["very","too"],"meanings":{"very":"to say that something is more than just normal or average","too":"to say it is much more than you need in a negative way"},"usage_en":{"very":"Use it for a high degree that is normal or positive","too":"Use it for a high degree that is not normal and therefore shows negative"},"usage_so":{"very":"Adeegso marka aad u jeeddo si aad ah laakiin ilaa heerka la doonayo","too":"Adeegso marka  aad u jeeddo aad iyo aad ilaa heer ay cillad noqoto"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf2f"},"slug":"on-time-vs-in-time","title":"on time vs in time","words":["on time","in time"],"meanings":{"on time":"exact time or right on time so you are not late","in time":"early enough so that you don’t miss anything"},"usage_en":{"on time":"Use it for exact time. If it is 10 then on time is at 10","in time":"Use it for anytime before something happens"},"usage_so":{"on time":"U adeegso marka ay ku taagan tahay saacadda la ballamay","in time":"U adeegso waqtiga aad ka gaari karto qorshe la dejiyey ama lugu ballamay"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf30"},"slug":"good-vs-well","title":"good vs well","words":["good","well"],"meanings":{"good":"tells you about something that is nice","well":"tells you how well something is or how well it is done."},"usage_en":{"good":"This is an adjective so use it to say more about the noun","well":"This is an adverb so use it to say more about the verb"},"usage_so":{"good":"Waa sifo wax ka sheegta magaca oo inta badan ka hor marta magaca","well":"Waa falkaab wax ka sheegta falka iyo sida wax loo qabtay."},"examples":["I don’t feel well today."]}
{"_id":{"$oid":"68a208fbcd62724bd55caf31"},"slug":"fun-vs-funny","title":"fun vs funny","words":["fun","funny"],"meanings":{"fun":"a noun which means anything that creates enjoyment","funny":"an adjective which means anything that makes you laugh"},"usage_en":{"fun":"Use it for something enjoyable","funny":"Use it for something that makes you laugh or smile"},"usage_so":{"fun":"xiiso leh ama lugu madadaasho markaa u adeegso arrin xiiso leh ama aad ka heleyso","funny":"xaraabo ama lugu qoslo markaa u adeegso xaalad laga xaraabaysto ama lugu qoslo"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf32"},"slug":"few-vs-a-few","title":"few vs a few","words":["few","a few"],"meanings":{"few":"Few means not many and not as many as needed or expected","a few":"A few means some and there are more than you need or expect"},"usage_en":{"few":"use few when there is not a lot of something with a negative feeling","a few":"use a few for something that is enough with a positive feeling"},"usage_so":{"few":"Macnaha ereyga few waa in yar laakiin waa ilaa heer aadan fileyn","a few":"Macnaha ereyga a few waa in yar laakiin waa ilaa heer macquul ah"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf33"},"slug":"tell-vs-say","title":"tell vs say","words":["tell","say"],"meanings":{"tell":"tell someone something which means to give information to someone","say":"say something which means to express ideas. Use to if you want to mention the person"},"usage_en":{"tell":"tell someone something so someone comes first. tell + someone + something","say":"say something so what you say comes first. say + something + (to someone)"},"usage_so":{"tell":"tell u sheeg weeyaan. Adeegso marka toos loo raaciyo cidda loo sheegayo","say":"say sheeg weeyaan laakiin inta badan cidda loo sheegayo lama raaciyo. Haddii la raaciyo adeegso to"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf34"},"slug":"you-and-i-vs-you-and-me","title":"you and I vs You and me","words":["you and I","You and me"],"meanings":{"you and I":"The subject position or the doer of the action","You and me":"The object position or the receiver of the action"},"usage_en":{"you and I":"Use You and I as the subject position","You and me":"Use You and me as the object position"},"usage_so":{"you and I":"U adeegso ficilka ama falka jumlada","You and me":"U adeegso la-yeelaha ama mafcuulka  jumlada"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf35"},"slug":"confusing-vs-confused","title":"confusing vs confused","words":["confusing","confused"],"meanings":{"confusing":"means when something is difficult to understand","confused":"means when a person doesn’t understand what is happening"},"usage_en":{"confusing":"Use it for things, people or situations that is difficult to understand","confused":"Use it how people or animals feel when they don’t understand"},"usage_so":{"confusing":"U adeegso wax, qof and xaalad lugu dawakho","confused":"U adeegso qof  ku dawakhsan wax"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf36"},"slug":"house-vs-home","title":"House vs Home","words":["House","Home"],"meanings":{"House":"the location or building where someone lives","Home":"a place where someone lives and feels comfortable"},"usage_en":{"House":"Use house to talk about the building or the location","Home":"Use home to talk about a place you call home and feel relaxed"},"usage_so":{"House":"Macnaha house waa guri. Adeegso marka aad dhismaha ka hadlayso ama halka uu ku yaalo","Home":"macnaha home waa hoy ama degaan qof uu deggen yahay oo uu raaxo ku dareemayo"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf37"},"slug":"complementary-vs-complimentary","title":"complementary vs complimentary","words":["complementary","complimentary"],"meanings":{"complementary":"two things that go well together or complete one another","complimentary":"free of charge but it also means saying good things about someone or something"},"usage_en":{"complementary":"Use it to talk about when something adds to the quality of something else or completes it","complimentary":"Use it for something that is free or when you praise or say good things about someone or something"},"usage_so":{"complementary":"Adeegso marka shay ama qof uu dhamaystiro ama bilo kan kale. Labo is kaaba..","complimentary":"macnaha complimentary waa bilaash ama wax lacag la'aan lugu bixiyo amaba ammaan iyo faan mudan"},"examples":[]}
{"_id":{"$oid":"68a208fbcd62724bd55caf38"},"slug":"who-vs-whom","title":"who vs whom","words":["who","whom"],"meanings":{"who":"a pronoun for people  which is used in the subject position for questions.","whom":"a pronoun for people  which is used in the object position for questions"},"usage_en":{"who":"Use it for the subject or to refer to  the doer of the action.","whom":"Use it for the object or to refer to  the reciever of the action"},"usage_so":{"who":"U adeegso su'aal la dooneyo in la ogaado cidda falka fulisey","whom":"U adeegso su'aal la dooneyo in la ogaado cidda falku ku socdo ama mafcuulka"},"examples":[]}
