{"_id":{"$oid":"68a016a36cd9d2041c7ba96a"},"idiom":"in a nutshell","example":"I had a lot of fun at the museum but  in a nutshell I saw lots of interesting things and learned a lot.","meaning":"make the long story short or to make it brief"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba96b"},"idiom":"left-handed compliment","example":"It is a left-handed compliment to say to someone  you look great for someone your age. This sounds good at first but it also means that people your age do not look good.","meaning":"praise or saying good things about someone but with a hidden insult"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba96c"},"idiom":"Jump to conclusions","example":"I saw a man running out of the shop with a bag and I jumped to the conclusion that he had stolen something but that was not the case.","meaning":"to make a decision before you have all the facts"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba96d"},"idiom":"go for broke","example":"She decided to go for broke and start her own business.","meaning":"to take a big risk even if it means to lose everything"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba96e"},"idiom":"go broke","example":"If you keep spending all your money you will later go broke and struggle to pay your bills.","meaning":"something that has already been decided or settled and cannot be changed"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba96f"},"idiom":"cut and dried","example":"The new plan is just a proposal and it is not as cut and dried as people think.","meaning":"to write a brief letter or message to someone"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba970"},"idiom":"drop a line","example":"If I don't hear from her by next week I will drop her a line.","meaning":"to hope for good luck"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba971"},"idiom":"keep your fingers crossed","example":"I will keep my fingers crossed that you pass your driving test tomorrow.","meaning":"to make a quick sound by clicking your fingers together."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba972"},"idiom":"snap your fingers","example":"As soon as I snap my fingers, please stand up and say your name.","meaning":"finding something easily when you need it"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba973"},"idiom":"at your fingertips","example":"With the help of a good dictionary all the words you need are at your fingertips","meaning":""}
{"_id":{"$oid":"68a016a36cd9d2041c7ba974"},"idiom":"get off the hook","example":"Mustafa forgot to do his homework but he got off the hook because the teacher was absent","meaning":"help someone to get out of a difficult situation"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba975"},"idiom":"on the house","example":"You pay for the food but the drinks are on the house.","meaning":"something that is given free of charge"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba976"},"idiom":"make a killing","example":"Ramla makes a killing from her new shares in the company.","meaning":"to get a lot of money in a short time"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba977"},"idiom":"kill two birds with one stone","example":"Let us drop off the kids at school and stop by the grocery store on the way so that we can kill two birds with one stone.","meaning":"to succeed in doing two things at the same time with one action"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba978"},"idiom":"one of a kind","example":"My uncle was one of a kind and I can never be like him.","meaning":"not like any other in the world"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba979"},"idiom":"tie the knot","example":"Ahmed and Eman are finally tying the knot this Friday.","meaning":"getting married"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba97a"},"idiom":"a level playing field","example":"Local companies want to compete on a level playing field with foreign companies.","meaning":"a fair situation in which everyone has an equal opportunity."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba97b"},"idiom":"light at the end of the tunnel","example":"After months of hard work there is finally light at the end of the tunnel.","meaning":"to see signs of hope after a difficult situtaion"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba97c"},"idiom":"my lips are sealed","example":"I cannot tell you anything about the meeting. My lips are sealed.","meaning":"a promise to keep a secret and not share any information."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba97d"},"idiom":"like it or lump it","example":"Like it or lump it, find another job if you don't like the offer.","meaning":"take it or leave it, whether you like it or not"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba97e"},"idiom":"by no means","example":"I am by no means an expert on this topic, but I can try to answer your question.","meaning":"not at all or definitely not"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba97f"},"idiom":"once in a blue moon","example":"My uncle lives in another country so I only get to see him once in a blue moon.","meaning":"almost never"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba980"},"idiom":"go overboard","example":"She often goes overboard when she gets angry.","meaning":"go too far or to do too much"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba981"},"idiom":"I owe you one","example":"Thanks for helping us move to our new house. I owe you one.","meaning":"I will do the same for you. You say it to someone who has done a favor for you."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba982"},"idiom":"a pat on the back","example":"The manager gave Bilal a pat on the back for finishing the project ahead of schedule.","meaning":"to congratulate or give credit to someone for doing a great job"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba983"},"idiom":"in a pinch","example":"I really need a million to start a new business but I guess half a million would do in a pinch.","meaning":"when it becomes necessary and you have no other choice"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba984"},"idiom":"in the pipeline","example":"There are new projects in the pipeline that will be out next year.","meaning":"something that is being planned or on the way"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba985"},"idiom":"take the plunge","example":"After years of working for other people, Asiya finally decided to take the plunge and start her own business.","meaning":"to take a big risk or make a big decision after thinking about it for a long time"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba986"},"idiom":"read between the lines","example":"Before you sign a contract, it is better to read between the lines to make sure you understand all the terms.","meaning":"try to understand the hidden meaning behind what someone is saying or writing"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba987"},"idiom":"red tape","example":"Many people complain about the amount of red tape they have to deal with when they are registering a new car.","meaning":"so many rules and steps that delay and make things difficult to complete"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba988"},"idiom":"as a last resort","example":"As a last resort I decided to ask my parents for a loan to pay the rent and other expenses.","meaning":"the final option available after all other options have been tried"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba989"},"idiom":"good riddance","example":"I am so glad that our noisy neighbors have finally moved out. Good riddance!","meaning":"a rude way of saying you are happy that someone or something is gone"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba98a"},"idiom":"ring a bell","example":"I can't remember his face, but the name does ring a bell.","meaning":"sounds familiar or reminds you of something but you cannot remember it clearly"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba98b"},"idiom":"on the rocks","example":"Their marriage has been on the rocks for months now.","meaning":"in trouble with lots of problems and will likely fail soon"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba98c"},"idiom":"rule of thumb","example":"As a rule of thumb, it is always a good idea to set aside a part of your income every month for emergencies.","meaning":"practical guideline that is often based on expreience"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba98d"},"idiom":"on a shoestring","example":"After graduating from university, Sara decided to travel around the world on a shoestring budget.","meaning":"limited budget like doing something with very little money"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba98e"},"idiom":"go off at a tangent","example":"Before we start the meeting, let us stay on topic and not go off on a tangent.","meaning":"to suddenly change the topic"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba98f"},"idiom":"up and running","example":"My computer is up and running now.","meaning":"operating or working normally"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba990"},"idiom":"have something up your sleeve","example":"It is always good to have something up your sleeve in case things don't go as planned.","meaning":"to have a secret plan or trick that you can use at the right time"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba991"},"idiom":"change your tune","example":"A year ago he was against the idea but now he changed his tune and fully supports it.","meaning":"to change your opinion or behavior"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba992"},"idiom":"blessing in disguise","example":"Losing my job was a blessing in disguise because it led me to start my own successful business.","meaning":"something that seems bad or unlucky at first but becomes something good later."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba993"},"idiom":"set in stone","example":"My holiday plans are not set in stone yet, so we can change the date if needed.","meaning":"unchangeable or something that cannot be changed"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba994"},"idiom":"give someone the benefit of the doubt","example":"She was late to the meeting, but I gave her the benefit of the doubt because she usually arrives on time.","meaning":"to trust someone even though you are not sure what they say is true"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba995"},"idiom":"not my cup of tea","example":"I know you love movies but it is  really not my cup of tea.","meaning":"not for me or something that someone is not interested in"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba996"},"idiom":"rock the boat","example":"Everyone seems happy with the decision so let us not rock the boat.","meaning":"to cause problems when the situation is calm or working just fine"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba997"},"idiom":"jump on the bandwagon","example":"I am not the kind of person who jumps on the bandwagon but I rather like to make my own choices.","meaning":"follow the crowd or  following something because it has become popular"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba998"},"idiom":"piece of cake","example":"I thought the test would be difficult but it was a piece of cake.","meaning":"very easy to do"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba999"},"idiom":"get a taste of your own medicine","example":"After years of spreading fake information about her friends, she finally got a taste of her own medicine when her best friend gossiped about her.","meaning":"to treat someone as badly as they have treated you or to get a dose of your own medicine"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba99a"},"idiom":"feeling under the weather","example":"She has been feeling under the weather since yesterday so she is resting at home.","meaning":"sick or not feeling well"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba99b"},"idiom":"rings a bell","example":"Your name rings a bell  but I can't remember where we met.","meaning":"sounds familiar or reminds me of something"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba99c"},"idiom":"the elephant in the room","example":"During the dinner, the fact that Sarah had not been invited became the elephant in the room.","meaning":"an important problem or issue that people avoid talking about"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba99d"},"idiom":"the devil is in the details","example":"They agreed on the deal quickly but the devil is in the details and negotiating the contract took weeks.","meaning":"the smallest parts of a work or the small details that are often the most difficult"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba99e"},"idiom":"the whole nine yards","example":"During the presentation she covered the whole nine yards leaving no question unanswered.","meaning":"do everything that is possible or the whole thing"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba99f"},"idiom":"tie up loose ends","example":"Maria  asked for a quick meeting to tie up loose ends before the weekend.","meaning":"to finalize or complete the final parts of work"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a0"},"idiom":"someone's true colors","example":"When the project faced difficulties, we saw his true colors as a leader.","meaning":"To show what you are really like or your real character"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a1"},"idiom":"bite off more than I can chew","example":"He bit off more than he could chew by registering too many advanced classes this term.","meaning":"to try to do too much or  take on more responsibility than you can really do"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a2"},"idiom":"wild card","example":"Hiring someone without a proper background check could be a wild card because you never know what problems they might bring.","meaning":"unpredictable like someone or a situation that is difficult to guess"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a3"},"idiom":"get back to the drawing board","example":"If this solution doesn't fix the problem, we'll have to get back to the drawing board.","meaning":"to start planning again or to begin again"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a4"},"idiom":"cut corners","example":"If you cut corners on the project, the final product may not meet the standards.","meaning":"to take shortcuts or do something in the quickest and cheapest way"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a5"},"idiom":"cross that bridge when we get to it","example":"I am not sure how we will pay the bills if you leave your job but let us cross that bridge when we get to it.","meaning":"to deal with a problem only when it happens not before"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a6"},"idiom":"icing on the cake","example":"She was excited to receive the job offer and the generous benefits package was the icing on the cake.","meaning":"an extra good thing added to an already good situation."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a7"},"idiom":"break the ice","example":"A fun game is a great way to break the ice at a meeting and get people talking to each other.","meaning":"to do or say something that helps people who are meeting for the first time feel more relaxed and comfortable with each other."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a8"},"idiom":"hit the nail on the head","example":"When she said the project failed due to poor communication, she really hit the nail on the head.","meaning":"to be exactly right about something"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9a9"},"idiom":"take something with a grain of salt","example":"When reading online reviews, it's wise to take them with a grain of salt.","meaning":"not to fully believe something"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9aa"},"idiom":"between a rock and a hard place","example":"He is caught between a rock and a hard place because he needs to choose between taking a lower-paying job and moving to a different city.","meaning":"to be in a very difficult situation where you have to make a tough decision."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9ab"},"idiom":"backhanded compliment","example":"She gave me a backhanded compliment by saying my dress was nice for someone my age.","meaning":"Something that someone says to you but has a hidden criticism."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9ac"},"idiom":"every cloud has a silver lining","example":"When I missed my flight, I reminded myself that every cloud has a silver lining, so I had a chance to explore a new city.","meaning":"There is something good in every bad situation."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9ad"},"idiom":"call it a day","example":"It is getting late, so let us call it a day and continue tomorrow.","meaning":"Let us stop working for the day."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9ae"},"idiom":"point fingers","example":"It is not helpful to point fingers when things go wrong; we need to find a solution.","meaning":"to accuse or blame someone"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9af"},"idiom":"ignorance is bliss","example":"She didn't want to know about the world's troubles, so she avoided the news. As they say, \"ignorance is bliss.\"","meaning":"sometimes it is better not knowing about a problem because knowing about it can cause worry or unhappiness"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b0"},"idiom":"leave no stone unturned","example":"We will leave no stone unturned to find the missing child.","meaning":"to  try everything possible or do everything you can to find something or solve a problem."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b1"},"idiom":"let the cat out of the bag","example":"Try not to let the cat out of the bag until the announcement is official","meaning":"to tell someone a secret often by mistake"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b2"},"idiom":"miss the boat","example":"You'll miss the boat if you don't buy shares now because the opportunity to invest at this price won't last long.","meaning":"to miss an opportunity because you are too slow or do not act in time."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b3"},"idiom":"best of both worlds","example":"He enjoys the best of both worlds by working part-time and studying.","meaning":"to have the benefits of two different things at the same time."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b4"},"idiom":"beat around the bush","example":"Stop beating around the bush and tell me what you really think.","meaning":"to avoid saying something directly."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b5"},"idiom":"can't have your cake and eat it too","example":"You want to save money but also go on vacation, but you can’t have your cake and eat it too.","meaning":"You cannot have both so you have to make a choice"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b6"},"idiom":"spill the beans","example":"I can’t believe you spilled the beans about our plan.","meaning":"to tell a secret"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b7"},"idiom":"see eye to eye","example":"My sister and I don’t always see eye to eye on everything.","meaning":"completely agree or be on the same page about something"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b8"},"idiom":"save something for a rainy day","example":"I always try to save a little money for a rainy day.","meaning":"to save or reserve something for future use when it is needed most."}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9b9"},"idiom":"shed light on something","example":"This new evidence sheds light on what really happened.","meaning":"to explain or make something easier to understand"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9ba"},"idiom":"speak of the devil","example":"Speak of the devil! I was just saying your name.","meaning":"used when someone you were talking about comes"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9bb"},"idiom":"neck of the woods","example":"If you’re ever in my neck of the woods, let me know.","meaning":"an area or neighborhood"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9bc"},"idiom":"wrap your head around something","example":"I need time to wrap my head around all this information.","meaning":"to find a way to understand something difficult"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9bd"},"idiom":"up in the air","example":"The future of the project is up in the air until we get funding from our donor.","meaning":"undecided like when no decision has been made"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9be"},"idiom":"judge a book by its cover","example":"Don’t judge a book by its cover because she may look quiet, but she is very talented.","meaning":"to evaluate or form an opinion on how something looks"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9bf"},"idiom":"turn a blind eye","example":"The manager knows about it, but he decided to turn a blind eye.","meaning":"to ignore something on purpose"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c0"},"idiom":"have got it in the bag","example":"The team is so far ahead, so they have got the game in the bag.","meaning":"something is guaranteed like when you are sure about the success of something"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c1"},"idiom":"stab in the back","example":"I thought he was my friend, but when he shared my secret it felt like a stab in the back.","meaning":"when a friend or someone you trusted betrays or harms you"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c2"},"idiom":"last straw","example":"I tried to stay patient but his rude comment was the last straw, and I couldn’t take it anymore.","meaning":"the final bad thing that happens causing you to give up or get really angry"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c3"},"idiom":"hang in there","example":"Life can be difficult but if you hang in there, you will find your way.","meaning":"to stay strong when you are in a difficult situation"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c4"},"idiom":"in the twinkling of an eye","example":"She answered the question in the twinkling of an eye.","meaning":"happens very fast or so quickly"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c5"},"idiom":"on the right track","example":"The scientists believe they are on the right track even though the research is still ongoing.","meaning":"going in the right direction or  making progress"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c6"},"idiom":"feather one's nest","example":"Many believe the president has been feathering his nest instead of serving the people.","meaning":"to make money for your own selfish interests"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c7"},"idiom":"run into difficulties","example":"The project ran into difficulties when the funding was cut off.","meaning":"to face problems often without expecting it"}
{"_id":{"$oid":"68a016a36cd9d2041c7ba9c8"},"idiom":"the proof is in the pudding","example":"The app looks great but the proof is in the pudding when customers start using it.","meaning":"you only know by trying or the results show the truth"}
